Revit 2027 API
View.GetTemporaryViewPropertiesName Method
 When Temporary View Properties mode is in progress, name of applied template is returned. Outside Temporary View Properties mode, empty string will be returned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetTemporaryViewPropertiesName()
Public Function GetTemporaryViewPropertiesName As String
public:
String^ GetTemporaryViewPropertiesName()
member GetTemporaryViewPropertiesName : unit -> string
Return Value
String
See Also
Reference
View Class
Autodesk.Revit.DB Namespace